
<?php
return array(
	 'MODULE_NAME'    => 'Hqapi',
     'IS_DEBUG'      => 0,
     'DB_TYPE'       => 'mysql',     // 数据库类型
     'DB_HOST'       => '112.84.186.241',//'221.6.167.248', // 服务器地址
     'DB_NAME'       => 'stocks',       // 数据库名
     'DB_USER'       => 'root',//'public',      // 用户名
     'DB_PWD'        => '2wsx#EDC',//'cngold',        // 密码
     'DB_PORT'       => 3306,        // 端口
     'DB_PREFIX'     => '',    // 数据库表前缀
     'DB_CHARSET'    => 'utf8',    // 字符集

	 'RTX_SERVER'    => '192.168.1.205',	 
	 'RTX_PORT'      => '8006',
		
	 'media_physical_path' => 'C:/wamp/www/yms_api/Public/', #媒体物理路径
	 'swf_tool_path'       => 'C:/SWFTools/pdf2swf.exe',#swf生成工具路径
     
	// 'DATA_CACHE_TYPE' => 'Memcache',
	 //'MEMCACHE_HOST'   => 'tcp://127.0.0.1:11211',
	 'DATA_CACHE_TYPE' => 'file',
	 'DATA_CACHE_TIME' => 3600*24,
	 'PROJECT_CLASS'   => array(
	 		     1 => '中金网',
			     2 => '金融家',
			     3 => '直播室',
 			     4 => '官网',
			     5 => '投了么',
			     6 => '其他',			     
	 ),
     'market_map'    => array(
               #sh
               '1100'=>'SH',
               '1101'=>'SH',
               '1102'=>'SH',
               '1103'=>'SH',
               '1104'=>'SH',
               '1109'=>'SH',
               '110c'=>'SH',
               #sz
               '1200'=>'SZ',
               '1201'=>'SZ',
               '1202'=>'SZ',
               '1203'=>'SZ',
               '1204'=>'SZ',
               '1206'=>'SZ',
               '1209'=>'SZ',
               '120b'=>'SZ',
               '120c'=>'SZ',
          ),
     'market_map_ex'    => array(
               #sh
               '1100'=>1,
               '1101'=>1,
               '1102'=>1,
               '1103'=>1,
               '1104'=>1,
               '1109'=>1,
               '110c'=>1,
               #sz
               '1200'=>2,
               '1201'=>2,
               '1202'=>2,
               '1203'=>2,
               '1204'=>2,
               '1206'=>2,
               '1209'=>2,
               '120b'=>2,
               '120c'=>2
          ),
     //节假日
     'history'=>array(
               '2017-01-01','2017-01-02',
               '2017-01-07','2017-01-08',
               '2017-01-14','2017-01-15',
               '2017-01-21',
               '2017-01-27','2017-01-28','2017-01-29','2017-01-30','2017-01-31',

               '2017-02-01','2017-02-02','2017-02-05',
               '2017-02-11','2017-02-12',
               '2017-02-18','2017-02-19',
               '2017-02-25','2017-02-26',

               '2017-03-04','2017-03-05',
               '2017-03-11','2017-03-12',
               '2017-03-18','2017-03-19',
               '2017-03-25','2017-03-26',

               '2017-04-02',
               '2017-04-03','2017-04-04','2017-04-08','2017-04-09',
               '2017-04-15','2017-04-16',
               '2017-04-22','2017-04-23',
               '2017-04-29','2017-04-30',

               '2017-05-01','2017-05-06','2017-05-07',
               '2017-05-13','2017-05-14',
               '2017-05-20','2017-05-21',
               '2017-05-28',
               '2017-05-29','2017-05-30',

               '2017-06-03','2017-06-04',
               '2017-06-10','2017-06-11',
               '2017-06-17','2017-06-18',
               '2017-06-24','2017-06-25',

               '2017-07-01','2017-07-02',
               '2017-07-08','2017-07-09',
               '2017-07-15','2017-07-16',
               '2017-07-22','2017-07-23',
               '2017-07-29','2017-07-30',

               '2017-08-05','2017-08-06',
               '2017-08-12','2017-08-13',
               '2017-08-19','2017-08-20',
               '2017-08-26','2017-08-27',

               '2017-09-02','2017-09-03',
               '2017-09-09','2017-09-10',
               '2017-09-16','2017-09-17',
               '2017-09-23','2017-09-24',

               '2017-10-01',
               '2017-10-02','2017-10-03','2017-10-04','2017-10-05','2017-10-06','2017-10-07','2017-10-08',
               '2017-10-14','2017-10-15',
               '2017-10-21','2017-10-22',
               '2017-10-28','2017-10-29',

               '2017-11-04','2017-11-05',
               '2017-11-11','2017-11-12',
               '2017-11-18','2017-11-19',
               '2017-11-25','2017-11-26',

               '2017-12-02','2017-12-03',
               '2017-12-09','2017-12-10',
               '2017-12-16','2017-12-17',
               '2017-12-23','2017-12-24',
               '2017-12-30','2017-12-31'
     ),
     //数据库初步状态断定
     'trade_map'=>array(
          0=>'unlisted',
          1=>'',
          2=>'quit',
          3=>'pause',
          4=>'exit'
          ),
     /*
     0：未上市
     1：--（再根据当前时间判断，过滤节假日、周末等）
               未开盘
               集合竞价
               休盘中
               交易中
     2：已退市
     3：暂停上市
     4：终止上市
     */
     'trade_status'=>array(
                    'unlisted' => array('num'=>'001','message'=>urlencode('未上市')),             //未上市
                    
                    'bid'      => array('num'=>'010','message'=>urlencode('集合竞价')),           //集合竞价
                    'rest'     => array('num'=>'011','message'=>urlencode('休盘中')),             //休盘中(休市)
                    'trading'  => array('num'=>'012','message'=>urlencode('交易中')),             //交易中
                    'stop'     => array('num'=>'013','message'=>urlencode('停牌')),               //停牌

                    'quit'     => array('num'=>'005','message'=>urlencode('退市')),               //退市
                    'pause'    => array('num'=>'006','message'=>urlencode('暂停上市')),           //暂停上市
                    'exit'     => array('num'=>'007','message'=>urlencode('终止上市')),           //终止上市
                    'delivery' => array('num'=>'008','message'=>urlencode('交收')),               //交收
          ),
     #集合竞价及其开收盘时间
     'time_limit'=>array(
                    'bid_time'=>array('s'=>'9:15:00',  'e'=>'9:29:00'),#集合竞价时间段
                    'am_time' =>array('s'=>'9:30:00',  'e'=>'11:30:00'),    #上午交易时间
                    'pm_time' =>array('s'=>'13:00:00', 'e'=>'15:00:00'),    #下午交易时间
          ),
     'block_type'=>array(
               'dy_plates',
               'gn_plates',
               'hy_plates'
          ),
     'cache_block'=>'block.php',
     'cache_block_code'=>'block_code.php',
     'raise_url'     => 'http://192.168.1.140:8080/StockWebServer/GetMap?market=SH_A,SH_B,SZ_A,SZ_B,SZ_MIDDLE,SZ_ACCOUNT&column=SORT_RAISE',
     'real_url'      => 'http://192.168.1.140:8080/StockWebServer/Snapshot?symbol=',	
     'domain_url'    => 'http://192.168.1.131',
     'media_url_pre' => 'http://192.168.1.131/yms_api/Public/',
     'param_err'     => array(500, urlencode('参数不合法')),
     'param_fmt_err' => array(500, urlencode('参数格式不正确')),
     'over_err'      => array(500, urlencode('超出范围')),
     'option_ok'     => urlencode('操作成功'),
     'option_fail'   => urlencode('操作失败'),
     'option_no_allow' => urlencode('不允许操作'),
     'is_exists'     => urlencode('存在'),
     'no_exists'  => urlencode('不存在'),
     'api_user_url'  => 'http://192.168.1.31:8300/Api/',
     'api_user_domain' => 'http://192.168.1.31:8300',
     'api_user_pic_url' => 'http://192.168.1.31:8300/imgcode?m=',
     'api_user_photo_url' => 'http://192.168.1.31:8310',
     'api_user_photo_def_url' => 'http://192.168.1.31:8310/useravatar.jpg',
     'KEY'                => 'souh*e_i#2?0>1&5',
     'mosquitto_server_url'=> 'http://192.168.1.131/phpmquttclient/send_mqtt.php',
	//'配置项'=>'配置值'
);
